group-reports/sharif/results/10G-disk-throughput-tuning-protocol-A-sndbuf-2M/test-3.txt
read-randomly-test-job: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
read-randomly-test-job: Laying out IO file (1 file / 10240MiB)

read-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=73003: Fri Jul 14 06:15:42 2023
   read: IOPS=68.2k, BW=533MiB/s (559MB/s)(312GiB/600005msec)
    slat (usec): min=2, max=521034, avg=222.21, stdev=914.05
    clat (usec): min=208, max=1138.5k, avg=3529.38, stdev=3790.87
     lat (usec): min=216, max=1139.7k, avg=3751.82, stdev=3931.82
    clat percentiles (usec):
     |  1.00th=[   725],  5.00th=[  1369], 10.00th=[  1762], 20.00th=[  2245],
     | 30.00th=[  2638], 40.00th=[  2966], 50.00th=[  3294], 60.00th=[  3654],
     | 70.00th=[  4080], 80.00th=[  4555], 90.00th=[  5342], 95.00th=[  6194],
     | 99.00th=[  8291], 99.50th=[  9503], 99.90th=[ 13304], 99.95th=[ 15664],
     | 99.99th=[238027]
   bw (  KiB/s): min=  112, max=43632, per=6.25%, avg=34104.08, stdev=4294.03, samples=19198
   iops        : min=   14, max= 5454, avg=4262.99, stdev=536.76, samples=19198
  lat (usec)   : 250=0.01%, 500=0.35%, 750=0.75%, 1000=1.25%
  lat (msec)   : 2=11.88%, 4=54.05%, 10=31.34%, 20=0.36%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=1.30%, sys=5.45%, ctx=23178082, majf=0, minf=662
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=40930525,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=533MiB/s (559MB/s), 533MiB/s-533MiB/s (559MB/s-559MB/s), io=312GiB (335GB), run=600005-600005msec

Disk stats (read/write):
    drbd1: ios=40928695/12, merge=0/0, ticks=63236702/348, in_queue=63237044, util=100.00%, aggrios=40930525/12, aggrmerge=0/0, aggrticks=63181390/348, aggrin_queue=63181738, aggrutil=100.00%
    dm-0: ios=40930525/12, merge=0/0, ticks=63181390/348, in_queue=63181738, util=100.00%, aggrios=40930290/9, aggrmerge=235/3, aggrticks=54386270/324, aggrin_queue=32468623, aggrutil=100.00%
  sde: ios=40930290/9, merge=235/3, ticks=54386270/324, in_queue=32468623, util=100.00%