group-reports/sharif/results/10G-disk-throughput-tuning-protocol-A-sndbuf-2M/test-5.txt
readwrite-randomly-test-job: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
readwrite-randomly-test-job: Laying out IO file (1 file / 10240MiB)

readwrite-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=76011: Fri Jul 14 06:36:21 2023
   read: IOPS=12.1k, BW=94.3MiB/s (98.9MB/s)(55.3GiB/600008msec)
    slat (usec): min=2, max=345148, avg=640.42, stdev=1654.75
    clat (usec): min=206, max=514782, avg=13003.90, stdev=8205.64
     lat (usec): min=214, max=515128, avg=13644.58, stdev=8387.30
    clat percentiles (usec):
     |  1.00th=[  1254],  5.00th=[  3621], 10.00th=[  5342], 20.00th=[  7439],
     | 30.00th=[  9110], 40.00th=[ 10552], 50.00th=[ 12125], 60.00th=[ 13698],
     | 70.00th=[ 15533], 80.00th=[ 17957], 90.00th=[ 21365], 95.00th=[ 25035],
     | 99.00th=[ 33162], 99.50th=[ 36963], 99.90th=[ 47449], 99.95th=[ 55313],
     | 99.99th=[341836]
   bw (  KiB/s): min=  288, max= 9200, per=6.25%, avg=6036.55, stdev=824.19, samples=19199
   iops        : min=   36, max= 1150, avg=754.54, stdev=103.03, samples=19199
  write: IOPS=5173, BW=40.4MiB/s (42.4MB/s)(23.7GiB/600008msec)
    slat (usec): min=2, max=354280, avg=1442.92, stdev=3019.92
    clat (usec): min=435, max=523950, avg=16186.80, stdev=9478.58
     lat (usec): min=501, max=526823, avg=17630.12, stdev=10013.02
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    6], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   12], 40.00th=[   14], 50.00th=[   15], 60.00th=[   17],
     | 70.00th=[   19], 80.00th=[   22], 90.00th=[   27], 95.00th=[   31],
     | 99.00th=[   42], 99.50th=[   47], 99.90th=[   61], 99.95th=[   72],
     | 99.99th=[  347]
   bw (  KiB/s): min=   96, max= 4288, per=6.25%, avg=2586.29, stdev=353.64, samples=19199
   iops        : min=   12, max=  536, avg=323.27, stdev=44.21, samples=19199
  lat (usec)   : 250=0.01%, 500=0.10%, 750=0.22%, 1000=0.21%
  lat (msec)   : 2=0.92%, 4=3.09%, 10=26.98%, 20=51.64%, 50=16.70%
  lat (msec)   : 100=0.11%, 250=0.01%, 500=0.02%, 750=0.01%
  cpu          : usr=0.55%, sys=3.06%, ctx=11647299, majf=0, minf=186
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7245075,3104102,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=94.3MiB/s (98.9MB/s), 94.3MiB/s-94.3MiB/s (98.9MB/s-98.9MB/s), io=55.3GiB (59.4GB), run=600008-600008msec
  WRITE: bw=40.4MiB/s (42.4MB/s), 40.4MiB/s-40.4MiB/s (42.4MB/s-42.4MB/s), io=23.7GiB (25.4GB), run=600008-600008msec

Disk stats (read/write):
    drbd1: ios=7242914/3103206, merge=0/0, ticks=42144409/26602076, in_queue=68746485, util=100.00%, aggrios=7245075/3104146, aggrmerge=0/0, aggrticks=42146729/21417006, aggrin_queue=63563735, aggrutil=99.27%
    dm-0: ios=7245075/3104146, merge=0/0, ticks=42146729/21417006, in_queue=63563735, util=99.27%, aggrios=7245056/3104138, aggrmerge=19/8, aggrticks=37567970/18908996, aggrin_queue=51283121, aggrutil=99.29%
  sde: ios=7245056/3104138, merge=19/8, ticks=37567970/18908996, in_queue=51283121, util=99.29%